snlkuharlocal/src/Documents/УстановкаСортировкиДляСайта/УстановкаСортировкиДляСайта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСортировкиДляСайта</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАнализа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияАнализа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексСортировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/УстановкаСортировкиДляСайта/ObjectModule.bsl
//нечаева 18,05,23+++
Процедура ЗарегистрироватьНоменклатуруб2б(Товар,Отказ,ОбменСтильпарк)
		
	ВыгрРодитель = ПроцедурыОбменаССайтом.ВыгружатьНаСайт(Товар,ОбменСтильпарк); // тут и родители проверяются
	Если ВыгрРодитель = "Да"   ТОгда 
		ПроцедурыОбменаССайтом.ПриЗаписиСправочникаОбменССайтомПриЗаписи(Товар,Отказ,ОбменСтильпарк);
	КонецЕсли;
		
КонецПроцедуры
//нечаева 18,05,23---


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//Если ЭтоНовый()ИЛИ ДатаСоздания = Дата(1,1,1) Тогда
	//	ДатаСоздания= ТекущаяДата();	
	//КонецЕсли;
	
	
	//нечаева 18,05,23+++
	Если ЭтоНовый()ИЛИ ДатаСоздания = Дата(1,1,1) Тогда
		
		ДатаСоздания= ТекущаяДата();
		
		// нечаева 18,05,23+++
		СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
		ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
		//Если ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SNL"  Тогда  // для тестов
		// временно тест	!!!!!
		
		//Кухарь А.Ю. 31.03.2026 начало
		// Если ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SNL"  И  ТекСтрокаСоединения=СтрокаСоединенияСразрешеннымОбменом Тогда
		Если ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SNL"  И  ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза()  Тогда
			//Кухарь А.Ю. 31.03.2026 конец
			
			// пропишем еще всю номенклатуру, которую нужно выгрузить, в обмен б2б выгрузить.
			Для каждого текстрока из товары цикл
				ОбменСтильпарк =ложь;
				ЗарегистрироватьНоменклатуруб2б(текстрока.Номенклатура,Отказ,ОбменСтильпарк);
			КонецЦикла;
			
		КонецЕсли;
		// нечаева 18,05,23 ---
		
	КонецЕсли;
	
	Если ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SNL"  И  ТекСтрокаСоединения=СтрокаСоединенияСразрешеннымОбменом Тогда
		
		//По каждой строке проверим, если ли изменения. и их зарегистрируем. 1. расхождения по строкам, 2, товары которых нет в какой либо из таблиц
		Если НЕ ЭтоНовый() и ЭтотОбъект.Модифицированность() ТОгда
			
			ТЗТоварыСсылка = ссылка.Товары;
			ТЗТоварыОбъект = ЭтотОбъект.Товары;
			// 1. различия по индексу сортировки
			Для каждого Текстр из ТЗТоварыСсылка цикл
				
				Поиск = ТЗТоварыОбъект.Найти(ТекСтр.номенклатура,"Номенклатура");
				Если  Поиск<>Неопределено Тогда
					Если  Текстр.ИндексСортировки <> поиск.ИндексСортировки Тогда
						ЗарегистрироватьНоменклатуруб2б(текстр.Номенклатура,Отказ,Ложь);
					конецЕсли;	
				иначе
					// если не нашли, то тоже в регистрацию на выгрузку
					ЗарегистрироватьНоменклатуруб2б(текстр.Номенклатура,Отказ,Ложь);
				КонецЕсли;
				
			конецЦикла;
			
			// в обратную сторону проверим, только по не найденным строкам.
			Для каждого Текстр из ТЗТоварыОбъект цикл
				
				Поиск = ТЗТоварыСсылка.Найти(ТекСтр.номенклатура,"Номенклатура");
				Если  Поиск=Неопределено Тогда
					// если не нашли, то тоже в регистрацию на выгрузку
					ЗарегистрироватьНоменклатуруб2б(текстр.Номенклатура,Отказ,Ложь);
				КонецЕсли;
				
			конецЦикла;
			
			
		КонецЕсли;
	КонецЕсли;
	//нечаева 18,05,23---
	
	
	
КонецПроцедуры
